[
  {
    "title": "Newton's First Law",
    "formula": null,
    "tags": ["physics", "motion", "inertia"],
    "description": "An object at rest stays at rest and an object in motion stays in motion with the same speed and direction unless acted upon by an unbalanced force. This law introduces the fundamental concept of inertia, highlighting the resistance of any physical object to a change in its velocity.",
    "favorite": false,
    "image": ""
  },
  {
    "title": "Newton's Second Law",
    "formula": "F = m * a",
    "tags": ["physics", "force", "acceleration"],
    "description": "This law explains how the velocity of an object changes when it is subjected to an external force. It states that the acceleration of an object is directly proportional to the net force acting upon it, and inversely proportional to its mass. It forms the basis of classical mechanics.",
    "favorite": true,
    "image": ""
  },
  {
    "title": "Newton's Third Law",
    "formula": null,
    "tags": ["physics", "reaction", "forces"],
    "description": "For every action, there is an equal and opposite reaction. This means that for every force applied to a body, the body applies a force of equal magnitude but in the opposite direction back. This principle is observed in rocket propulsion and many contact interactions.",
    "favorite": false,
    "image": ""
  },
  {
    "title": "Law of Universal Gravitation",
    "formula": "F = G * (m1 * m2) / r^2",
    "tags": ["gravity", "forces", "physics"],
    "description": "Newton’s Law of Universal Gravitation states that every mass attracts every other mass in the universe, and the force between two bodies is proportional to the product of their masses and inversely proportional to the square of the distance between them. It laid the foundation for gravitational theory.",
    "favorite": false,
    "image": ""
  },
  {
    "title": "Ohm's Law",
    "formula": "V = I * R",
    "tags": ["electricity", "circuits", "physics"],
    "description": "Ohm’s Law relates voltage (V), current (I), and resistance (R) in an electrical circuit. It states that the current through a conductor between two points is directly proportional to the voltage across the two points, provided the temperature remains constant. It is fundamental to circuit design.",
    "favorite": true,
    "image": ""
  },
  {
    "title": "Avogadro's Number",
    "formula": "N_A = 6.022e23",
    "tags": ["chemistry", "constants", "moles"],
    "description": "Avogadro’s number defines the number of atoms, ions, or molecules in one mole of a substance. It is a fundamental constant used to relate the macroscopic scale of matter to the number of constituent particles. It's critical in stoichiometric calculations and unit conversions in chemistry.",
    "favorite": false,
    "image": ""
  },
  {
    "title": "Ideal Gas Law",
    "formula": "PV = nRT",
    "tags": ["chemistry", "gases", "thermodynamics"],
    "description": "The Ideal Gas Law combines Boyle's, Charles's, and Avogadro's laws into one equation. It describes the relationship between pressure, volume, temperature, and the number of moles of a gas using a universal gas constant. While idealized, it's useful for modeling many gas behaviors under normal conditions.",
    "favorite": false,
    "image": ""
  },
  {
    "title": "Boyle's Law",
    "formula": "P1 * V1 = P2 * V2",
    "tags": ["gas laws", "chemistry", "pressure"],
    "description": "Boyle’s Law states that the pressure of a gas is inversely proportional to its volume when temperature and quantity remain constant. This means compressing a gas increases its pressure, and allowing it to expand decreases pressure. It is a fundamental principle in fluid dynamics.",
    "favorite": false,
    "image": ""
  },
  {
    "title": "Charles's Law",
    "formula": "V1 / T1 = V2 / T2",
    "tags": ["chemistry", "gas", "temperature"],
    "description": "Charles’s Law states that the volume of an ideal gas is directly proportional to its absolute temperature at constant pressure. As the temperature of a gas increases, so does its volume. This principle is critical in understanding thermal expansion and balloon behavior.",
    "favorite": false,
    "image": ""
  },
  {
    "title": "First Law of Thermodynamics",
    "formula": "ΔU = Q - W",
    "tags": ["thermodynamics", "physics", "energy"],
    "description": "The First Law of Thermodynamics is essentially a statement of energy conservation. It states that the change in the internal energy of a closed system is equal to the heat added to the system minus the work done by the system. It is foundational in energy management and heat engines.",
    "favorite": false,
    "image": ""
  },
  {
    "title": "Second Law of Thermodynamics",
    "formula": null,
    "tags": ["entropy", "heat", "energy"],
    "description": "The Second Law states that the total entropy of an isolated system can never decrease over time. It introduces the concept of irreversibility in natural processes and is the basis for understanding heat flow, energy efficiency, and why perpetual motion machines are impossible.",
    "favorite": false,
    "image": ""
  },
  {
    "title": "pH Definition",
    "formula": "pH = -log[H+]",
    "tags": ["chemistry", "acids", "solutions"],
    "description": "The pH scale measures the acidity or basicity of an aqueous solution. It is a logarithmic scale where lower values indicate high hydrogen ion concentration (acidic) and higher values indicate low hydrogen ion concentration (basic). pH is essential in biochemistry, medicine, and agriculture.",
    "favorite": false,
    "image": ""
  },
  {
    "title": "Snell's Law",
    "formula": "n1 * sin(θ1) = n2 * sin(θ2)",
    "tags": ["optics", "refraction", "physics"],
    "description": "Snell’s Law describes how light bends when it passes through media of different refractive indices. It quantifies the angle of refraction using sine functions and the respective indices. It’s critical in lens design, fiber optics, and understanding how light behaves in water or glass.",
    "favorite": false,
    "image": ""
  },
  {
    "title": "Hooke's Law",
    "formula": "F = -k * x",
    "tags": ["elasticity", "forces", "physics"],
    "description": "Hooke’s Law explains how the force needed to extend or compress a spring is proportional to the distance it is stretched. The negative sign indicates that the force is restorative. It is a key concept in mechanical engineering and structural design.",
    "favorite": false,
    "image": ""
  },
  {
    "title": "Coulomb's Law",
    "formula": "F = k * (q1 * q2) / r^2",
    "tags": ["electrostatics", "forces", "physics"],
    "description": "Coulomb’s Law describes the force between two charged particles. The force is proportional to the product of the charges and inversely proportional to the square of the distance between them. It underpins electrostatic interactions and fields in classical physics.",
    "favorite": false,
    "image": ""
  },
  {
    "title": "Bernoulli's Principle",
    "formula": null,
    "tags": ["fluids", "physics", "pressure"],
    "description": "Bernoulli’s Principle states that for an incompressible, frictionless fluid, the total mechanical energy remains constant. In practical terms, faster moving fluids exert less pressure. This principle explains flight, carburetors, and many fluid motion phenomena.",
    "favorite": false,
    "image": ""
  },
  {
    "title": "Planck's Equation",
    "formula": "E = h * f",
    "tags": ["quantum", "physics", "photons"],
    "description": "Planck’s Equation relates the energy of a photon to its frequency via Planck’s constant. This concept is foundational in quantum theory, particularly in understanding quantized energy levels, blackbody radiation, and the photoelectric effect.",
    "favorite": false,
    "image": ""
  },
  {
    "title": "Einstein's Mass-Energy Equivalence",
    "formula": "E = m * c^2",
    "tags": ["relativity", "energy", "mass"],
    "description": "Einstein’s famous equation reveals that mass can be converted to energy and vice versa. It is foundational to nuclear physics and explains how immense energy is released from small amounts of mass in fission and fusion.",
    "favorite": false,
    "image": ""
  },
  {
    "title": "Speed of Light in Vacuum",
    "formula": "c = 299,792,458 m/s",
    "tags": ["constants", "physics", "light"],
    "description": "The speed of light in a vacuum is a fundamental constant of nature and serves as the cosmic speed limit. It is essential in all relativity calculations and electromagnetic theory, and is one of the most precisely known constants in physics.",
    "favorite": false,
    "image": ""
  },
  {
    "title": "Heisenberg's Uncertainty Principle",
    "formula": "Δx * Δp ≥ ħ / 2",
    "tags": ["quantum", "measurement", "limits"],
    "description": "This principle states that one cannot simultaneously know both the position and momentum of a particle with arbitrary precision. It reflects a fundamental limit of measurement in quantum systems, not a flaw in instruments, and has deep implications for atomic-scale predictability.",
    "favorite": false,
    "image": ""
  }
]
