{
  "title": "Iron",
  "formula": "Fe",
  "tags": [
    "mineral",
    "element",
    "periodic table",
    "ore",
    "metal"
  ],
  "favorite": false,
  "description": "Iron is a chemical element with the symbol Fe and atomic number 26. It is a transition metal and one of the most abundant elements in the universe, formed in large quantities in stellar cores and supernovae. On Earth, iron is the most common element by mass, making up a significant portion of the planet’s core, crust, and mantle. In its elemental form, iron is a silvery-gray metal that is malleable, ductile, and highly reactive with oxygen, forming iron oxides such as rust when exposed to air and moisture.\n\nIn its mineral form, iron is found in a number of naturally occurring ores, including hematite (Fe₂O₃), magnetite (Fe₃O₄), and siderite (FeCO₃). Hematite and magnetite are the two most economically significant iron ores used in the global production of steel. Magnetite is notable for its magnetic properties, while hematite often appears as reddish, metallic crystals or earthy masses. Iron minerals are typically formed through igneous, metamorphic, and sedimentary processes and are often extracted via open-pit mining.\n\nAs a refined metal, iron is widely used in construction, engineering, transportation, and manufacturing. Pure iron is relatively soft, but when alloyed with small amounts of carbon (typically 0.1–2%), it forms steel—a material that is much stronger and more durable. Other alloying elements like chromium, nickel, and vanadium produce specialized steels with properties like corrosion resistance, high tensile strength, or hardness. Cast iron, on the other hand, contains a higher carbon content and is used in heavy-duty applications like machinery bases and engine blocks.\n\nIron is also biologically essential. It plays a critical role in the human body as part of hemoglobin, the protein in red blood cells responsible for transporting oxygen. Iron deficiency leads to anemia, while excessive iron accumulation can result in toxicity. The element exists in multiple oxidation states, most commonly +2 (ferrous) and +3 (ferric), which gives it versatile chemical behavior in both organic and inorganic contexts.",
  "image": ""
}